app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params["file"].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-06-30 14:59:05.840301"], ["updated_at", "2019-06-30 14:59:05.840301"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2019-06-30 14:59:05.845169"], ["updated_at", "2019-06-30 14:59:05.845169"]]